module.exports = {
  CHAT_TYPE: {
    saved: 0,
    dialog: 1,
    public: 2,
  },
  RANDOM_NAME: [
    'Черепах',
    'Лосось',
    'Копибара',
    'ПикаЧуПакабра',
    'Кот',
    'Орлан',
    'Стрекоз',
    'Колобок',
    'Волчара',
    'Енот',
    'Пантера',
  ],
  RANDOM_PROP: [
    'Прыгучий',
    'Крикливый',
    'XXL',
    'Непокорный',
    'Властный',
    'Зоркий',
    'Любвиобильный',
    'Колючий',
    'HЕ Позорный',
    'Накуренный',
    'Неуклюжая',
  ],
  SOCKET_TYPE: {
    pong: 'pong',
    message: 'message',
  }
}